// 霸都丶傲天 2019/7/9  https://Github.com/AJLoveChina
var config = {
    // 下面的句子不一定非要7句， 你也可以改成4句，2句话都可以
    lines: [
        "亲爱的晨晨",
        "花开一季，有落红为证",
        "逝去的岁月，如何能托于烟尘",
        "你的浅笑，是我永生眷恋",
        "相思的真情，是否能明白一二",
        "亲爱的宝贝，你是我的唯一",
        "爱你永远。。。",
        我们都曾闪过分开的念头，总觉得那样或许对彼此都好，可我们从来没有认真想过，若是我们咬咬牙一直走下去，会不会收获更圆满的未来。
        我从来没有想过要放弃我们的感情，更没有半分要离开你的打算。
        在我心里，真爱从不是累了就散、不合适就分，而是哪怕前路再难，也想和你凑在一起，不管遇到什么问题，我们都一起扛、一起面对。
        这么久了，宝贝，你的气也该消得差不多了吧。
        昨晚我翻了一整夜我们的聊天记录，一字一句，都藏着我们的温柔与欢喜，就像重新陪你走过了一遍，再一次满心满眼都是你。如果还能继续在一起，
        我想安安静静地坐在你身边，认真听你诉说最近所有的委屈，不打断、不辩解，只好好抱着你，把这些日子亏欠你的温柔，都一一补给你。
        这次的分开，让我真正懂了珍惜的意义，
        也让我更加确定，我不能没有你，往后我们好好走，感情一定会更长久、更安稳。
            我知道，我做过很多让你堵心的事，说过不少惹你不快的话，有时候还特别招人烦，让你一次次失望、难过。
        可我是真的爱你，这份爱从来都没有掺过半点虚假，你在我心里的位置，重到任何人都挪不开，也无可替代。
            对不起，我太犟，总猜不透你的心思，还总爱跟你抬杠，忽略你的情绪，让你受了很多委屈。
        这段时间我反复回想，看清了自己所有的不足，也明白那些让你失望的地方，都是我该好好改正的地方。
            我知道，一句对不起、一份承诺，不足以弥补我之前对你的亏欠，但我是真的想改，是真的想和你好好走下去。
                我不敢保证自己一下子就能变得完美，但我会一点点努力，把所有的不好都改掉，把所有的温柔都给你。再给我一次机会，好不好？
    ],
    // 相爱的时间 记住格式不能写错了, 非常重要
    // 格式一定要和下面这个时间格式一样
    // 分别是 年-月-日T时时:分分:秒秒
    //      温馨警告:
    //          1.时分秒都必须是俩个数字  比如 00:00:00
    //          2.T不能丢了
    date: "2021-03-01T00:00:00",
    // 双方的名字
    names: ["znk", "yc"]
}
